package day04;

public class Exam3 {
    public static void main(String[] args) {
        
        /*
        JAVA 배열: *동일한타입*의 여러 자료들을 순서(인덱스)대로 저장하는 *(하나의)타입*
        선언 : 2가지
            - 타입[ ] 변수명 = new 타입명[총계수];         vs   let 변수명 = []
            - 타입[ ] 변수명 = {초기값, 초기값, 초기값};    vs   let 변수명 = [초기값, 초기값, 초기값]\
        특징 : 1) 동일한 타입끼리  2) 고정(정적)길이  3) 요소 초기값(자동)
        인덱스 : 요소(자료)들이 저장되는 순서 번호, 0번시작
        */

        String[ ] arry2 = {"유재석","강호동", "신동엽"};    // String형 3개 초기화한 배열 선언
        

    }//m e
}//c e
